<a href="https://colab.research.google.com/github/aryanpatil1503/Machine-Learning-Project1/blob/master/aryan_cities_by_day.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
path="/content/drive/MyDrive/FTS_CSV/cities_by_day.csv"
df=pd.read_csv(path)
df.head()

        City      Date  PM2.5  PM10     NO  ...  C6H6   C7H8  C8H10  AQI  AQI_Bucket
0  Ahmedabad  1/1/2015    NaN   NaN   0.92  ...  0.00   0.02   0.00  NaN         NaN
1  Ahmedabad  1/2/2015    NaN   NaN   0.97  ...  3.68   5.50   3.77  NaN         NaN
2  Ahmedabad  1/3/2015    NaN   NaN  17.40  ...  6.80  16.40   2.25  NaN         NaN
3  Ahmedabad  1/4/2015    NaN   NaN   1.70  ...  4.43  10.14   1.00  NaN         NaN
4  Ahmedabad  1/5/2015    NaN   NaN  22.10  ...  7.01  18.89   2.78  NaN         NaN

[5 rows x 16 columns]

In [ ]:
df.tail()

                City       Date  PM2.5   PM10  ...   C7H8  C8H10   AQI    AQI_Bucket
29526  Visakhapatnam  6/27/2020  15.02  50.94  ...  12.07   0.73  41.0          Good
29527  Visakhapatnam  6/28/2020  24.38  74.09  ...   2.21   0.38  70.0  Satisfactory
29528  Visakhapatnam  6/29/2020  22.91  65.73  ...   0.01   0.00  68.0  Satisfactory
29529  Visakhapatnam  6/30/2020  16.64  49.97  ...   0.00   0.00  54.0  Satisfactory
29530  Visakhapatnam   7/1/2020  15.00  66.00  ...    NaN    NaN  50.0          Good

[5 rows x 16 columns]

In [ ]:
df.size

472496

In [ ]:
df.shape

(29531, 16)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29531 entries, 0 to 29530
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        29531 non-null  object
 1   Date        29531 non-null  object
 2   PM2.5       24933 non-null  float64
 3   PM10        18391 non-null  float64
 4   NO          25949 non-null  float64
 5   NO2         25946 non-null  float64
 6   NOx         25346 non-null  float64
 7   NH3         19203 non-null  float64
 8   CO          27472 non-null  float64
 9   SO2         25677 non-null  float64
 10  O3          25509 non-null  float64
 11  C6H6        23908 non-null  float64
 12  C7H8        21490 non-null  float64
 13  C8H10       11422 non-null  float64
 14  AQI         24850 non-null  float64
 15  AQI_Bucket  24850 non-null  object
dtypes: float64(13), object(3)
memory usage: 3.6+ MB

In [ ]:
df.describe()

              PM2.5          PM10  ...         C8H10           AQI
count  24933.000000  18391.000000  ...  11422.000000  24850.000000
mean      67.450578    118.127103  ...      3.070128    166.463581
std       64.661449     90.605110  ...      6.323247    140.696585
min        0.040000      0.010000  ...      0.000000     13.000000
25%       28.820000     56.255000  ...      0.140000     81.000000
50%       48.570000     95.680000  ...      0.980000    118.000000
75%       80.590000    149.745000  ...      3.350000    208.000000
max      949.990000   1000.000000  ...    170.370000   2049.000000

[8 rows x 13 columns]

In [ ]:
df.isnull().sum()

City              0
Date              0
PM2.5          4598
PM10          11140
NO             3582
NO2            3585
NOx            4185
NH3           10328
CO             2059
SO2            3854
O3             4022
C6H6           5623
C7H8           8041
C8H10         18109
AQI            4681
AQI_Bucket     4681
dtype: int64

In [ ]:
"""NaN=df['PM2.5'].isna().sum()
print("NaN=",NaN)
total=24933             #from count operation
non_null=total-NaN
print("None null=",non_null)"""

def NonNull(column):                          #to count non null values of each column
  NaN=df[column].isna().sum()
  total=29531                     #number of entries
  non=int(total)-int(NaN)
  print(column,"-> Non NULL=",non)

columns=df.columns
for column in columns:
  NonNull(column)

City -> Non NULL= 29531
Date -> Non NULL= 29531
PM2.5 -> Non NULL= 24933
PM10 -> Non NULL= 18391
NO -> Non NULL= 25949
NO2 -> Non NULL= 25946
NOx -> Non NULL= 25346
NH3 -> Non NULL= 19203
CO -> Non NULL= 27472
SO2 -> Non NULL= 25677
O3 -> Non NULL= 25509
C6H6 -> Non NULL= 23908
C7H8 -> Non NULL= 21490
C8H10 -> Non NULL= 11422
AQI -> Non NULL= 24850
AQI_Bucket -> Non NULL= 24850

In [ ]:
non_null=df['C8H10'].count()
null=df['C8H10'].isnull().sum()
print(non_null,"   ",null)

11422     18109

In [ ]:
#In the column C8H10 number of NaN values are more than number of non null so we can drop this column.
df=df.drop(['C8H10'],axis=1)
df.head()

        City      Date  PM2.5  PM10     NO  ...      O3  C6H6   C7H8  AQI  AQI_Bucket
0  Ahmedabad  1/1/2015    NaN   NaN   0.92  ...  133.36  0.00   0.02  NaN         NaN
1  Ahmedabad  1/2/2015    NaN   NaN   0.97  ...   34.06  3.68   5.50  NaN         NaN
2  Ahmedabad  1/3/2015    NaN   NaN  17.40  ...   30.70  6.80  16.40  NaN         NaN
3  Ahmedabad  1/4/2015    NaN   NaN   1.70  ...   36.08  4.43  10.14  NaN         NaN
4  Ahmedabad  1/5/2015    NaN   NaN  22.10  ...   39.31  7.01  18.89  NaN         NaN

[5 rows x 15 columns]

In [ ]:
#replacing NaN values in columns of type float with respective mean
columns=df.columns
for name in columns:
  if name=="City" or name=="Date" or name=="AQI_Bucket":
    continue
  else:
    df[name].fillna(df[name].mean(axis=0),inplace=True)
df.head()

        City      Date      PM2.5  ...   C7H8         AQI  AQI_Bucket
0  Ahmedabad  1/1/2015  67.450578  ...   0.02  166.463581         NaN
1  Ahmedabad  1/2/2015  67.450578  ...   5.50  166.463581         NaN
2  Ahmedabad  1/3/2015  67.450578  ...  16.40  166.463581         NaN
3  Ahmedabad  1/4/2015  67.450578  ...  10.14  166.463581         NaN
4  Ahmedabad  1/5/2015  67.450578  ...  18.89  166.463581         NaN

[5 rows x 15 columns]